# нөхцөлт илэрхийлэл
print("<<<Эерэг, сөрөг, тэг эсэхийг шалгах>>>")
n = int(input("Таны шалгах тоо: "))
if n > 0:
    print("Эерэг тоо байна")
elif n == 0:
    print("0 гэсэн тоо байна")
else:
    print("Сөрөг тоо байна")



print("<<<Эерэг, сөрөг, тэг эсэхийг шалгах>>>")
n = int(input("Таны шалгах тоо: "))
if n > 0:
    print("Эерэг тоо байна")
elif n == 0:
    print("0 гэсэн тоо байна")
elif n < 0:
    print("Сөрөг тоо байна")



# давхар if
number = int(input("Бүхэл тоо оруулна уу: "))
if number > 0:
    if number % 2 == 0:
        print("Эерэг бөгөөд тэгш тоо") 
    else:
        print("Эерэг бөгөөд сондгой тоо")