from django.http import Http404, HttpResponse
from django.shortcuts import render

# Create your views here.
def index(request):
    return render(request, "singlepageapp/index.html")

texts = ["*Ад үзэгдэх зориг* бол энгийн нэг ном биш. Ихэнх хүний бодож байгаа шиг урам зоригийн уншлага ч биш. Гарчгаас нь хөөж таасан шиг хувь хүний хөгжлийн ном бас биш. Хэн нэгний намтар, эсвэл ангайлгам амжилтын түүх ч биш. Эсээ, тэмдэглэл, эргэцүүллийн аль нь ч биш. Ерөөс унших бүрд шинэ өнцөг, гүн өнгө мэдрүүлэм энэ номыг аль нэг ангилалд багтааж, хайрцаглах нь өөрөө учир дутагдалтай мэт.",
        "Хамгийн эхэнд онцолсончлон энэ бол хариулт эрсэн түмэн асуулттай тулгарсан залуу хүүгийн үнэний төлөөх эрэл хайгуулын үр дүн. Тэр багаасаа л эцэг эхийнхээ шахалтан дунд хүмүүжиж, тэднээсээ зөрүүдлэн *нэгэн хэвийн* уйтгартай ажлаар амьдралаа зогоож яваа нэгэн. Яагаад ч юм өөрийгөө бусдаас тусгаарлаж, бүтэлгүй азгүй амьтан гэсэн шошго өөртөө наасан залуу. Амьдралаас таашаал авахгүй ч байгаа юм шиг, хийж байгаа болгондоо сэтгэл дундуур ч байдаг юм шиг, үргэлж өрөөлөөс шалтаг эрж, болохгүй байгаа зүйлс болгонд хувь заяагаа буруутгана. Тэр ерөөс цаг хугацааны эргүүлгэнд гацчихсан, энэ дэлхийн хамгийн азгүй хүн гэж өөрийгөө боддог гэмээр. Танил ч санагдах шиг.",
        "Түүнтэй таван шөнийг амьдралын утга учрын тухай ярилцан өнгөрүүлэх философич бол харин түүний эсрэг тусгал. Нэгэн удаа *Өнөөдрийн миний яриаг сонссон хүн одоо энэ мөчөөс эхлэн аз жаргалтай болж чадна* гэх лекцэнд суусан цагаас түүний амьдрал орвонгоороо өөрчлөгджээ. Үнэхээр л түүний хувьд амьдрал гэдэг туулж гарахад амархан, хорвоо ертөнц гэж ойлгож ядамгүй туйлын энгийн эд аж. Тэр бол аз жаргалтай, хийж байгаа ажил нь утга учиртай, бүх зүйлс нь дүүрэн хүн."]

def section(request, num):
    if 1 <= num <= 3:
        return HttpResponse(texts[num - 1])
    else:
        raise Http404("Өөр хэсэг байхгүй")

